from rag.retriever.simple_retriever import SimpleRetriever
from rag.segmenter.simple_segmenter import SimpleSegmenter

raw_text = """Искусственный интеллект (ИИ) — это обширная область компьютерных наук, занимающаяся созданием машин, способных выполнять задачи, требующие человеческого интеллекта. К ним относятся обучение, логическое рассуждение, восприятие и понимание языка.

История ИИ началась в середине XX века. Ключевым моментом стала Дартмутская конференция 1956 года, где сам термин «искусственный интеллект» был впервые предложен. С тех пор область пережила несколько периодов оптимизма, за которыми следовали «зимы ИИ» — времена снижения финансирования и интереса.

Основные ветви ИИ включают машинное обучение (МО) и глубокое обучение (ГО). Машинное обучение — это метод, при котором компьютеры учатся на данных без явного программирования. Глубокое обучение, подраздел МО, использует многослойные нейронные сети для моделирования сложных паттернов.

Сегодня ИИ находит применение в самых разных сферах. В медицине он помогает ставить диагнозы и разрабатывать лекарства. В беспилотных автомобилях компьютерное зрение на основе ИИ распознает дорожные знаки и пешеходов. Виртуальные ассистенты, такие как Siri и Алиса, используют обработку естественного языка (NLP) для понимания наших запросов.

Несмотря на прогресс, перед ИИ стоят серьезные вызовы. Этические вопросы, такие как конфиденциальность данных, смещение алгоритмов и потенциальная потеря jobs, вызывают активные дискуссии в обществе. Будущее ИИ видится в сотрудничестве человека и машины, где каждый усиливает сильные стороны другого.


 """
slides = ["Что такое ИИ?", "Историческое развитие", "Машинное и глубокое обучение", "Примеры применения", "Этика и будущее"]

if __name__ == "__main__":
    segmenter = SimpleSegmenter(raw_text)
    segments = segmenter.split()
    retriever = SimpleRetriever(segments)
    print(retriever.retrieve_relevant_segments(slides))