
text = """
Введение

В современном мире компании сталкиваются с необходимостью безопасного хранения и
управления конфиденциальными данными, такими как пароли, токены доступа и
криптографические ключи. Утечка такой информации может привести к серьезным
последствиям, включая финансовые потери, репутационный ущерб и юридические санкции.
Ручное управление секретами или использование устаревших методов, таких как хранение
данных в текстовых файлах, увеличивает риски утечек и затрудняет контроль доступа.

Даже актуальные решения, такие как HashiCorp Vault [1] или AWS Secrets Manager [2], часто
оказываются сложными в настройке и интеграции, требуют значительных ресурсов и не всегда
предоставляют достаточную гибкость для адаптации под конкретные бизнес-задачи. Это создает
потребность в более простых, но при этом надежных и масштабируемых решениях, которые
могли бы обеспечить безопасное хранение данных, гибкое управление доступом и удобство
использования для сотрудников.

Цели и задачи:

Цель работы — разработка веб-приложения, предоставляющего централизованное решение
для безопасного хранения и управления корпоративными секретами. Оно будет использовать
ролевую модель доступа (RBAC [3]), интеграцию с Keycloak [4] для аутентификации и
многофакторную аутентификацию (MFA [5]). Уникальной особенностью является
использование изолированных рабочих пространств, где пользователи могут гибко управлять
правами доступа к секретам.

Основные задачи разработки включают реализацию следующей функциональности:

® Управление секретами: Создание, редактирование и удаление конфиденциальных
данных (пароли, токены, ключи) с настройкой срока действия.

® Ролевая модель доступа (ВВАС): Гибкое управление правами пользователей в рамках
рабочих пространств.

® Рабочие пространства: Изолированные области для хранения и управления секретами
с возможностью добавления пользователей и назначения ролей.

® Интеграция с Keycloak: Авторизация и аутентификация пользователей через единую
систему.

® Журнал аудита: Логирование всех действий пользователей для обеспечения
прозрачности и безопасности.

® Уведомления через Telegram-6ora [6]: Оперативное информирование о событиях,

таких как изменения в секретах или истечение их срока действия.


® Шифрование данных: Защита конфиденциальной информации с использованием

AES-256.


1. Глава 1. Предметная область и существующие решения
1.1. Описание предметной области

В современном мире, где информационные технологии играют ключевую роль в бизнесе и
повседневной жизни, безопасность данных становится одной из самых актуальных проблем.
Корпоративные секреты, такие как пароли, $5Н-ключи, токены доступа и сертификаты,
являются критически важными элементами, обеспечивающими функционирование ИТ-
инфраструктуры. Утечка таких данных может привести к серьезным последствиям, включая
финансовые потери, репутационный ущерб и даже юридические санкции. В связи с этим,
управление корпоративными секретами становится важной задачей для любой организации,
стремящейся минимизировать риски и обеспечить безопасность своих данных.

Однако управление секретами вручную или с использованием устаревших методов
(например, хранение паролей в текстовых файлах) сопряжено с множеством вызовов. Это и
сложность контроля доступа, и риск утечек, и трудности с аудитом и мониторингом. В условиях
растущих киберугроз и ужесточения требований к защите данных, компании нуждаются в
современных инструментах, которые помогут им эффективно управлять секретами и
обеспечивать их безопасность.

Для пользователей, таких как ИТ-администраторы и сотрудники компаний, приложение
предоставляет удобный и безопасный способ управления корпоративными секретами. Оно
упрощает процесс хранения и доступа к конфиденциальной информации, снижая риск ошибок
и утечек. Ролевая модель доступа позволяет администраторам гибко настраивать права для
различных пользователей и команд, что обеспечивает соблюдение принципа минимальных
привилегий. Кроме того, интеграция с системами аутентификации, такими как Keycloak, и
поддержка многофакторной аутентификации (МЕА) повышают уровень безопасности.

Для компаний, которые будут использовать это приложение, оно предоставляет не только
удобство, но и уверенность в безопасности своих данных. Приложение позволяет
минимизировать риски утечек, упростить управление учетными данными и обеспечить
соответствие требованиям внутреннего и внешнего аудита. Ведение журналов аудита и
возможность экспорта логов позволяют компаниям оперативно реагировать на инциденты и
анализировать действия пользователей.

Кроме того, приложение обеспечивает баланс между простотой использования и
индивидуальностью. Оно предлагает гибкие настройки, такие как создание рабочих
пространств, настройка прав доступа и интеграция с Т@есгат-ботом для уведомлений, что

делает его удобным для различных сценариев использования. При этом оно сохраняет высокий


уровень безопасности, что особенно важно для компаний, работающих с конфиденциальной
информацией.

В современном контексте, где информационная безопасность становится критически
важной, такие инструменты играют ключевую роль в обеспечении устойчивости бизнеса. Они
помогают компаниям минимизировать риски, связанные с утечками данных, и обеспечивают
соответствие требованиям регуляторов. Таким образом, данное приложение не только решает
актуальные проблемы, но и способствует формированию культуры безопасности в

организациях, что делает его ценным инструментом в современной ИТ-инфраструктуре.

1.2. Описание существующих решений

На рынке уже существует множество решений, таких как HashiCorp Vault, AWS Secrets
Manager, | Password [7] и другие, которые предлагают различные подходы к хранению и защите
секретов. Однако каждое из этих решений имеет свои ограничения, будь то сложность
настройки, высокая стоимость или недостаточная гибкость интеграции с корпоративными
системами. В данной части я проведу сравнительный анализ моего приложения с ключевыми
конкурентами, чтобы выделить его преимущества и определить нишу, в которой оно может быть

наиболее востребованным.

1.2.1. Описание приложения HashiCorp Vault

HashiCorp Vault — это комплексное, но гибкое приложение для хранения и управления
секретами. Взаимодействие с ним осуществляется через веб-интерфейс, API или командную
строку. HashiCorp Vault предназначено для безопасной работы с конфиденциальными данными,
такими как учетные данные, ключи API, сертификаты и токены доступа. Приложение широко
используется в корпоративной среде, обеспечивая централизованный контроль и защиту
секретов.

Для работы с HashiCorp Vault пользователи могут зарегистрироваться и войти в систему
через различные методы аутентификации. Поддерживаются интеграции с LDAP, OAuth
(например, Keycloak), JWT [8], GitHub и другими провайдерами, что позволяет использовать
существующую инфраструктуру безопасности. Доступ к хранилищу строго регулируется с
помощью ролей и политик (КВАС), что позволяет гибко управлять правами пользователей и
сервисов.

Внутри HashiCorp Vault пользователи могут создавать изолированные пространства
(namespaces) для хранения секретов. Добавление и управление секретами происходит через веб-
интерфейс, API или CLI, где можно задать параметры, такие как имя, значение, время жизни
(TTL) и метаданные. HashiCorp Vault поддерживает автоматическую ротацию ключей,

обеспечивая дополнительный уровень безопасности.
8


Доступ к секретам можно получить через АР[-запросы или интерфейс приложения. Однако,
чтобы предотвратить несанкционированное использование, HashiCorp Vault позволяет выдавать
временные токены, которые автоматически истекают через заданный промежуток времени.
Политики доступа гибко настраиваются, позволяя ограничивать права пользователей на чтение,
изменение или удаление данных.

Помимо базового хранения секретов, HashiCorp Vault предоставляет дополнительные
функции, такие как динамическая выдача учетных данных. Это означает, что приложение может
создавать временные пароли для баз данных или облачных сервисов, которые автоматически
удаляются после использования. Также поддерживается встроенное шифрование и
дешифрование данных, что позволяет безопасно передавать информацию между сервисами без
хранения открытых ключей.

Для бизнеса HashiCorp Vault предлагает расширенные возможности, включая интеграцию с
облачными платформами AWS, Azure и ССР. Организации могут развертывать приложение в
режиме высокой доступности, распределяя нагрузку между несколькими узлами. Для
дополнительной защиты можно использовать аппаратные модули безопасности (HSM) для
хранения криптографических ключей.

Таким образом, HashiCorp Vault — это надежное решение для защиты секретов,
обеспечивающее централизованное управление доступом и безопасность конфиденциальных
данных. Оно подходит как для небольших команд, так и для крупных организаций, которым

необходим высокий уровень контроля и защиты информации.

1.2.2. Описание приложения AWS Secrets Manager

AWS Secrets Manager — это облачный сервис для безопасного хранения и управления
конфиденциальными данными, такими как пароли, ключи API, учетные данные для баз данных
и другие секреты. Сервис интегрирован с экосистемой AWS и предоставляет удобный способ
автоматизации ротации секретов, аутентификации и доступа к защищенным данным.

AWS Secrets Manager поддерживает несколько методов аутентификации, включая AWS
Identity and Access Management [9] (IAM), что позволяет точно настраивать права доступа для
пользователей и сервисов. С помощью 1АМ-политик администраторы могут контролировать,
кто может создавать, просматривать, изменять и удалять секреты. Для дополнительной
безопасности можно настроить многофакторную аутентификацию (МЕА).

Пользователи могут создавать и управлять секретами через AWS Management Console, API
или командную строку (AWS CLI). Каждый секрет включает такие параметры, как имя,

значение, версии, а также опциональные теги для организации ресурсов. AWS Secrets Manager


автоматически шифрует данные с использованием AWS Key Management Service (KMS),
обеспечивая защиту на уровне облачной инфраструктуры.

Получить доступ к секрету можно с помощью АР![-запросов или SDK, что позволяет легко
интегрировать его с приложениями и сервисами. AWS Secrets Manager поддерживает
автоматическую ротацию учетных данных для баз данных AWS, включая Amazon RDS, Aurora
и Redshift. Это означает, что сервис может периодически изменять пароли без вмешательства
пользователя, обновляя их в базах данных и в самом хранилище.

Дополнительно AWS Secrets Manager поддерживает возможность использования кросс-
аккаунтного доступа, что полезно для организаций с несколькими АУ/5-аккаунтами. Это
позволяет централизованно управлять секретами и безопасно предоставлять доступ разным
командам или сервисам.

Таким образом, AWS Secrets Manager — это надежное облачное решение для управления
конфиденциальными данными, обеспечивающее безопасность, автоматизацию и удобную
интеграцию с сервисами AWS. Оно идеально подходит для организаций, которые хотят

централизованно управлять секретами и минимизировать риски, связанные с утечками данных.

1.2.3. Описание приложения 1 Password

1Password — это кроссплатформенное приложение для хранения и управления паролями,
конфиденциальными данными и другими секретами. Оно предназначено как для
индивидуального, так и для корпоративного использования, обеспечивая надежную защиту
учетных данных с помощью сквозного шифрования. Приложение доступно на мобильных
устройствах, компьютерах и в виде веб-версии, а также поддерживает интеграцию с браузерами.

Для использования 1Password пользователи создают учетную запись и проходят
двухфакторную аутентификацию (2ЕА) для дополнительной защиты. Вход в систему возможен
с помощью мастер-пароля и специального секретного ключа, который генерируется при
регистрации и хранится только у пользователя. Организации могут управлять доступом
сотрудников через админ-панель.

Внутри 1Разз\ога можно создавать безопасные хранилища (vaults), в которых хранятся
пароли, кредитные карты, документы, лицензии и другие важные данные. Каждая запись
содержит название, логин, пароль, ОВГ-адрес, заметки и дополнительные поля. Все данные
зашифрованы с помощью AES-256 и хранятся на серверах |Password или локально, в
зависимости от настроек пользователя.

Доступ к сохраненным данным осуществляется через приложение, браузерные расширения

или API. 1Password автоматически заполняет пароли на сайтах и в приложениях, устраняя

10


необходимость запоминания сложных комбинаций. Также есть функция генерации надежных
паролей, которая помогает создавать уникальные учетные данные для каждого сервиса.

Приложение поддерживает функцию Watchtower, которая уведомляет пользователей о
скомпрометированных паролях, утечках данных и устаревших паролях. Также предусмотрена
возможность безопасного обмена учетными данными внутри команды или семьи через общие
хранилища.

Для бизнеса 1Password предлагает централизованное управление учетными записями
сотрудников, контроль доступа и интеграцию с корпоративными системами, такими как Azure
AD, Ока и OneLogin. Администраторы могут настраивать политики безопасности,
двухфакторную аутентификацию и мониторить активность пользователей.

Таким образом, | Password — это простое и удобное решение для защиты конфиденциальной
информации, обеспечивающее безопасность личных и корпоративных данных, удобный доступ

и простоту управления секретами.

1.2.4. Описание приложения LastPass Enterprise

LastPass Enterprise [10] — это корпоративное решение для хранения, управления и
безопасного обмена паролями внутри организаций. Оно позволяет сотрудникам удобно работать
с учетными данными, минимизируя риски, связанные с утечками или слабыми паролями.
LastPass Enterprise доступен как веб-приложение, desktop приложение, мобильное приложение
и расширение для браузеров, что делает его удобным для использования на любых устройствах.

Система аутентификации LastPass Enterprise поддерживает вход через единый мастер-
пароль, многофакторную аутентификацию (MFA) и интеграцию с провайдерами единого входа
(SSO), такими как Azure AD, Okta и Google Workspace. Администраторы могут централизованно
управлять доступом сотрудников, настраивать политики безопасности и контролировать
действия в системе через панель управления.

Каждый пользователь получает личное зашифрованное хранилище (vault) для хранения
паролей, секретных заметок и других конфиденциальных данных. Пароли можно
организовывать в папки, а также делиться ими с коллегами, задавая уровни доступа (только
просмотр или редактирование). Все данные зашифрованы с использованием алгоритма AES-
256, а расшифровка происходит только на стороне пользователя, обеспечивая нулевое
разглашение (Zero-Knowledge Security).

Доступ к паролям осуществляется через веб-интерфейс, мобильные приложения и
расширения для браузеров, которые автоматически подставляют учетные данные на сайтах и в
приложениях. Также есть встроенный генератор надежных паролей, который помогает

создавать уникальные комбинации для каждого ресурса.

11


Газ Разз Enterprise предоставляет функции мониторинга безопасности, включая аудит
паролей, выявление слабых и повторяющихся паролей, а также уведомления о
скомпрометированных учетных данных. Инструмент Dark Web Monitoring анализирует утечки
данных и предупреждает пользователей, если их пароли обнаружены в базах взломанных
аккаунтов.

Для крупных организаций LastPass Enterprise предлагает детализированные политики
доступа, отчеты об использовании и интеграцию с SIEM-cuctemamu. Также доступна
возможность автоматического предоставления и отзыва доступа при изменении ролей
сотрудников.

Таким образом, LastPass Enterprise — это надежное корпоративное решение для управления
паролями, которое повышает безопасность организаций, снижает нагрузку на ГТ-отдел и

обеспечивает удобный доступ сотрудников к их учетным данным.

1.2.5. Описание разрабатываемого решения

Веб-приложение для хранения корпоративной конфиденциальной информации — это
приложение, предназначенное для безопасного управления конфиденциальными данными
компаний, такими как 55Н-ключи, токены доступа, сертификаты и пароли. Приложение
ориентировано на корпоративное использование, обеспечивая строгий контроль доступа к
секретам и защиту данных через ролевую модель управления и шифрование.

Приложение поддерживает систему учетных записей с авторизацией через Keycloak, что
позволяет интегрировать его в корпоративную инфраструктуру безопасности. Гибкая настройка
прав доступа позволяет разграничивать доступ к секретам в зависимости от роли пользователя
и рабочего пространства.

Секреты хранятся в изолированных рабочих пространствах, к которым можно добавлять
пользователей с различными уровнями прав. Создание, редактирование и удаление секретов
происходит через веб-интерфейс, а также с помощью API. Встроенные механизмы логирования
фиксируют все действия пользователей, обеспечивая полную прозрачность изменений.

Доступ к секретам осуществляется через веб-приложение и API, а уведомления о действиях
с секретами могут отправляться через Теертат-бот. Бот также позволяет просматривать
выбранные пользователем уведомления о событиях, что делает систему удобной для
оперативного отслеживания изменений.

Приложение поддерживает автоматическое удаление секретов по истечении их срока

действия. Для безопасности все данные хранятся в зашифрованном виде.

12


Для удобства использования веб-интерфейс разработан Ha React [11] с адаптивной версткой,
а серверная часть реализована на Node.js и TypeScript, интеграция с Keycloak упрощает
управление авторизацией.

Таким образом, веб-приложение для хранения корпоративных секретов предоставляет
безопасную и гибкую платформу для управления конфиденциальной информацией в

корпоративной среде, обеспечивая контроль, аудит и удобство работы с секретами.

1.3. Анализ существующих решений

В Таблице 1 представлено сравнение существующих решений и разрабатываемого сервиса.

Таблица 1 — Сравнение существующих и разрабатываемого решений

```html
<table>
  <thead>
    <tr>
      <th>Параметр</th>
      <th>HashiCorp Vault</th>
      <th>AWS Secrets Manager</th>
      <th>1Password</th>
      <th>LastPass Enterprise</th>
      <th>Предложенное решение</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Способы аутентификации</td>
      <td>LDAP, OAuth, GitHub, Keycloak, MFA</td>
      <td>IAM (AWS), MFA</td>
      <td>Мастер-пароль, 2FA</td>
      <td>Мастер-пароль, MFA</td>
      <td>Keycloak, MFA</td>
    </tr>
    <tr>
      <td>Модель управления доступом</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
    </tr>
    <tr>
      <td>Где хранятся данные</td>
      <td>Локально, в облаке</td>
      <td>В облаке AWS</td>
      <td>В облаке 1Password</td>
      <td>В облаке LastPass</td>
      <td>Локально</td>
    </tr>
    <tr>
      <td>Шифрование</td>
      <td>AES-256, TLS</td>
      <td>AES-256, TLS</td>
      <td>AES-256, сквозное шифрование</td>
      <td>AES-256, Zero-Knowledge Security</td>
      <td>AES-256</td>
    </tr>
    <tr>
      <td>Интеграция с внешними сервисами</td>
      <td>Kubernetes, AWS, GCP, Azure</td>
      <td>AWS Lambda, RDS, DynamoDB</td>
      <td>Браузеры</td>
      <td>Браузеры</td>
      <td>Telegram-бот</td>
    </tr>
    <tr>
      <td>Мобильное приложение</td>
      <td>-</td>
      <td>-</td>
      <td>+</td>
      <td>+</td>
      <td>-</td>
    </tr>
    <tr>
      <td>Автоматическая ротация секретов</td>
      <td>Да, для баз данных и облачных сервисов</td>
      <td>Да, для AWS-ресурсов</td>
      <td>-</td>
      <td>-</td>
      <td>Да, настройка сроков действия секретов</td>
    </tr>
    <tr>
      <td>Журналирование и аудит</td>
      <td>Подробное ведение логов</td>
      <td>CloudTrail</td>
      <td>Watchtower (мониторинг утечек паролей)</td>
      <td>Dark Web Monitoring, аудит</td>
      <td>Логирование всех действий пользователей</td>
    </tr>
    <tr>
      <td>Поддержка MFA</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
    </tr>
    <tr>
      <td>Доступ через АРІ</td>
      <td>Да, REST API [12]</td>
      <td>Да, AWS SDK</td>
      <td>-</td>
      <td>-</td>
      <td>Да, REST API</td>
    </tr>
  </tbody>
</table>
```
[IMAGE_1]

13


```html
<table>
  <thead>
    <tr>
      <th>Поддержка мобильных приложений</th>
      <th>-</th>
      <th>-</th>
      <th>+</th>
      <th>+</th>
      <th>-</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>Стоимость</td>
      <td>Open-source, платные корпоративные версии</td>
      <td>Платная, зависит от количества секретов</td>
      <td>Подписка для частных лиц и бизнеса</td>
      <td>Подписка для бизнеса</td>
      <td>Бесплатное, Open-source</td>
    </tr>
    <tr>
      <td>Поддержка SSO</td>
      <td>Да, с провайдерами OAuth и LDAP</td>
      <td>Да, через IAM и AWS SSO</td>
      <td>Да, с корпоративными аккаунтами</td>
      <td>Да, с корпоративными аккаунтами</td>
      <td>Да, через Keycloak</td>
    </tr>
    <tr>
      <td>Возможность развёртывания on-premise</td>
      <td>+</td>
      <td>-</td>
      <td>-</td>
      <td>-</td>
      <td>+</td>
    </tr>
    <tr>
      <td>Поддержка командной работы</td>
      <td>Да, с granular RBAC</td>
      <td>Да, через IAM</td>
      <td>Да, через общие хранилища</td>
      <td>Да, через группы пользователей</td>
      <td>Да, через рабочие пространства</td>
    </tr>
    <tr>
      <td>Наличие техподдержки</td>
      <td>Да, в платной версии</td>
      <td>+</td>
      <td>+</td>
      <td>+</td>
      <td>-</td>
    </tr>
  </tbody>
</table>
```
[IMAGE_2]

Выводы по главе

В данной главе рассматривается предметная область и описываются проблемы, которые решает
приложение для хранения корпоративной конфиденциальной информации. Дается обзор проблемы
с точки зрения бизнеса и его сотрудников.

Также производится обзор существующих решений и их функционала, а затем — обзор
разрабатываемого решения в виде функциональных требований и сравнительный анализ между

НИМИ.

14


2. Глава 2. Проектирование хранилища
2.1. Пользовательские сценарии

В данном разделе содержатся пользовательские сценарии, которые описывают основные
взаимодействия пользователей с системой, позволяя понять, как реализованы функции
управления учетными записями, секретами и правами доступа. Основная цель веб-приложения
— обеспечить надежное хранение и безопасный обмен конфиденциальными данными внутри
корпоративной среды. Для удобства восприятия в раздел добавлена визуализация сценариев в
виде диаграмм прецедентов, иллюстрирующих процессы аутентификации, работы с секретами
и настройки доступов к ним.

Основой системы является учетная запись пользователя, которая обеспечивает доступ к
функционалу приложения. Пользователи регистрируются в системе через внешнюю систему
аутентификации Keycloak. Авторизация возможна как по логину и паролю, так и через SSO
(Single Sign-On). После входа в систему пользователи могут управлять своими профилями,
изменять настройки безопасности и настраивать многофакторную аутентификацию (MFA) для

повышения уровня защиты данных.


[IMAGE_3]

Рисунок | — Диаграмма прецедентов AuthModule
Приложение организует взаимодействие между пользователями через рабочие пространства.

Его администратор может добавлять участников в пространство, назначая им определенные
15


роли и права. Например, одни пользователи могут только просматривать секреты, в то время как
другие получают возможность их редактировать или удалять. При необходимости участники
могут быть удалены из рабочего пространства, что автоматически закрывает им доступ ко всем
связанным секретам.
Веб-интерфейс системы позволяет пользователям просматривать список участников
рабочих пространств и управлять их правами. Такая гибкая модель доступа гарантирует, что

конфиденциальные данные остаются в пределах установленных границ безопасности.


[IMAGE_4]

Рисунок 2 — Диаграмма прецедентов WorkspaceModule, WorkspaceUserModule,
RolesModule, RoleBindingsModule

Ключевая функциональность системы сосредоточена вокруг управления секретами.
Пользователи могут создавать записи с конфиденциальными данными, такими как З5Н-ключи,
АРГ-токены, сертификаты и пароли. Каждому секрету можно задать уникальные параметры,
включая срок действия и уровень доступа.

Редактирование и удаление секретов доступны только тем пользователям, у которых есть
соответствующие права. Для удобства администраторы могут настраивать видимость секретов,
определяя, кто может их просматривать и изменять. Это позволяет разделить доступ между
различными командами внутри компании, предотвращая несанкционированный доступ к

критически важным данным.

16



[IMAGE_5]

Рисунок 3 — Диаграмма прецедентов SecretsModule

Система также поддерживает интеграцию с внешними ресурсами. Пользователи могут
экспортировать логи активности в текстовом формате для анализа, а уведомления о ключевых
изменениях в секретах отправляются через Telegram-6or, что делает процесс мониторинга более
удобным.

В отличие от платформ для хранения пользовательского контента, приложение не
предусматривает публичного доступа к секретам. Однако внутри системы администраторы
могут управлять шаблонами политик безопасности и настраивать рекомендации по
конфигурациям доступа. Эти рекомендации доступны всем пользователям внутри организации
и помогают выстраивать безопасную модель хранения секретов.

Приложение предоставляет автоматизированные инструменты для управления сроками
действия секретов. Администраторы могут задавать политики автоматического обновления или

удаления устаревших данных, что снижает риски хранения неактуальных учетных данных.

17


Система также ведет историю всех изменений, что позволяет пользователям отслеживать,
кто и когда вносил правки в конфиденциальную информацию. Для неавторизованных
пользователей работа с секретами недоступна, так как приложение требует входа для доступа к

любым данным.


[IMAGE_7]

Рисунок 4 — Диаграмма прецедентов LoggingModule и EventBindingsModule
Для информирования пользователей о важных событиях реализована система уведомлений.
Она позволяет получать сообщения о запросах на доступ, изменениях в секретах и системных

предупреждениях, связанных с безопасностью.


[IMAGE_6]

Рисунок 5 — Диаграмма прецедентов ChatBindingsModule

18


Уведомления отправляются в режиме реального времени через Telegram-6ora. Пользователь
может настроить типы событий, о которых он хочет получать оповещения, что делает систему

более удобной и гибкой.

2.2. Архитектура приложения

Архитектура веб-приложения для хранения корпоративных конфиденциальных данных
основана на современных принципах разработки, обеспечивающих безопасность,
масштабируемость и гибкость системы. Для описания архитектурных решений используются
визуальные инструменты, такие как UML [13] и С4-модели [14], которые помогают представить
структуру компонентов, их взаимодействие и потоки данных. Основная цель этого раздела —
объяснить устройство системы, ее логику и ключевые механизмы работы.

Приложение построено по трехслойной клиент-серверной архитектуре, включающей
клиентскую часть, серверный слой с бизнес-логикой и базу данных. Клиентская часть
представляет собой веб-приложение, разработанное на React с использованием TypeScript. Оно
обеспечивает удобный интерфейс для управления секретами, рабочими пространствами и
правами доступа. Серверная часть реализована на Node.js с использованием TypeScript и
представляет собой REST API, отвечающее за обработку запросов клиентов, аутентификацию
пользователей и управление данными. Вся информация хранится в реляционной базе данных
PostgreSQL [15], где секреты, пользователи и рабочие пространства организованы в виде

отдельных таблиц с четко определенными связями.


[IMAGE_8]

Рисунок 6 — Диаграмма C4 архитектуры приложения

19
"""




from dotenv import load_dotenv
import os

from setup.setup import setup
from rag.segmenter.window_segmenter import WindowSegmenter
from rag.segmenter.paragraph_segmenter import ParagraphSegmenter
from rag.presentation_gen.slide_generation import create_presentation_plan
from rag.retriever.paragraph_retriever import ParagraphRetriever
from rag.presentation_gen.build_presentation import build_presentation
from visgen.simple_enchancer import enhance_slides_with_visualizations
from text_recognition.pdf_to_text import pdf_to_text
from pathlib import Path

def main():
    load_dotenv()

    OPENROUTER_API_KEY = os.getenv("API_KEY")

    # text, images_dict = pdf_to_text("src/pdf_files/example1.pdf")

    window_segmenter = WindowSegmenter(text)
    chunks = window_segmenter.split()

    slides = create_presentation_plan(chunks, OPENROUTER_API_KEY)

    #ОТКЛЮЧЕНО ДЛЯ ТЕТСИРОВАНИЯ
    # segmenter = ParagraphSegmenter(text)
    # segments = segmenter.split()

    # retriever = ParagraphRetriever(segments)
    # relevant_segments = retriever.retrieve_relevant_segments(slides)
    # retriever.clear()

    relevant_segments = [""] * len(slides)
    
    # --------------------------------------------------
    # НОВЫЙ ЭТАП: Добавление визуализаций
    # --------------------------------------------------
    print(f"\n{'='*60}")
    print("ЭТАП: ДОБАВЛЕНИЕ ВИЗУАЛИЗАЦИЙ К СЛАЙДАМ")
    print(f"{'='*60}")
    
    enhanced_slides = enhance_slides_with_visualizations(
        slides=slides,
        api_key=OPENROUTER_API_KEY,
        temp_dir="presentation_visualizations",
        delay=0.5
    )
    
    vis_count = sum(1 for s in enhanced_slides if s.get("visualization", {}).get("needed"))
    print(f"\n ИТОГО: {vis_count} слайдов из {len(enhanced_slides)} получили визуализации")
    
    build_presentation(enhanced_slides, Path("presentation_with_visualizations.pptx"))
    
    print(f"\n{'='*60}")
    print("ПРЕЗЕНТАЦИЯ СОЗДАНА!")
    print(f"{'='*60}")
    print(f"Всего слайдов: {len(enhanced_slides)}")
    print(f"С визуализациями: {vis_count}")
    print(f"Без визуализаций: {len(enhanced_slides) - vis_count}")
    print(f"Файл: presentation_with_visualizations.pptx")
    print(f"{'='*60}")
    
    for i, slide in enumerate(enhanced_slides):
        print(f"\n--- Слайд {i+1} ---")
        print(f"Заголовок: {slide.get('title', 'No title')}")
        vis = slide.get("visualization", {})
        if vis.get("needed"):
            print(f"Визуализация: {vis.get('type')}")
            print(f"   Файл: {Path(vis.get('image_path', '')).name}")
            print(f"   Заголовок графика: {vis.get('chart_title', '')}")
        else:
            print(f"Без визуализации")


    # build_presentation(slides, Path("presentation.pptx"))
    
    # print(f"Number of slides: {len(slides)}")
    # print(f"Number of relevant segments: {len(relevant_segments)}")
    
    # for i, slide in enumerate(slides):
    #     print(f"\n--- Slide {i+1} ---")
    #     print(f"Title: {slide.get('title', 'No title')}")
    #     print(f"Description: {slide.get('description', 'No description')}")
    #     print(f"Relevent segment:\n {relevant_segments[i]}")
    


if __name__ == "__main__":
    setup()
    main()